cfe/src/InformationRegisters/ИИ_НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ИИ_НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe/src/InformationRegisters/ИИ_НастройкиПользователей/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает значение пользовательской настройки из регистра сведений.
//
// Параметры:
//  КлючНастройки - Строка - имя настройки.
//  ЗначениеПоУмолчанию - Строка - значение, возвращаемое при отсутствии записи.
//  ИмяПользователяНастройки - Строка - имя пользователя, для которого читается настройка.
//                                     Если не указано, используется текущий пользователь.
//
// Возвращаемое значение:
//  Строка - значение настройки.
//
Функция ПолучитьНастройкуПользователя(
		Знач КлючНастройки,
		Знач ЗначениеПоУмолчанию = "",
		Знач ИмяПользователяНастройки = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяПользователяНастройки) Тогда
		ИмяПользователяНастройки = ИмяПользователя();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|   ИИ_НастройкиПользователей.Значение КАК Значение
		|ИЗ
		|   РегистрСведений.ИИ_НастройкиПользователей КАК ИИ_НастройкиПользователей
		|ГДЕ
		|   ИИ_НастройкиПользователей.Пользователь = &Пользователь
		|   И ИИ_НастройкиПользователей.КлючНастройки = &КлючНастройки";
	Запрос.УстановитьПараметр("Пользователь", ИмяПользователяНастройки);
	Запрос.УстановитьПараметр("КлючНастройки", КлючНастройки);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Возврат Строка(РезультатЗапроса.Значение);
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции

// Сохраняет значение пользовательской настройки в регистр сведений.
//
// Параметры:
//  КлючНастройки - Строка - имя настройки.
//  Значение - Строка - сохраняемое значение.
//  ИмяПользователяНастройки - Строка - имя пользователя, для которого сохраняется настройка.
//                                     Если не указано, используется текущий пользователь.
//
Процедура УстановитьНастройкуПользователя(
		Знач КлючНастройки,
		Знач Значение,
		Знач ИмяПользователяНастройки = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяПользователяНастройки) Тогда
		ИмяПользователяНастройки = ИмяПользователя();
	КонецЕсли;
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Пользователь = ИмяПользователяНастройки;
	Запись.КлючНастройки = КлючНастройки;
	Запись.Значение = Значение;
	Запись.Записать();
	
КонецПроцедуры

// Возвращает персональную подсказку (prompt hint) текущего пользователя.
//
// Возвращаемое значение:
//  Строка - текст подсказки.
//
Функция ПолучитьПромптПодсказкуПользователя() Экспорт
	
	Возврат ПолучитьНастройкуПользователя("ПромптПодсказка");
	
КонецФункции

// Сохраняет персональную подсказку (prompt hint) текущего пользователя.
//
// Параметры:
//  ТекстПодсказки - Строка - текст подсказки.
//
Процедура УстановитьПромптПодсказкуПользователя(Знач ТекстПодсказки) Экспорт
	
	УстановитьНастройкуПользователя("ПромптПодсказка", ТекстПодсказки);
	
КонецПроцедуры

#КонецОбласти
